---
kind: type
id: T:Autodesk.Revit.DB.ImageTypeStatus
source: html/b84b2403-3c15-b917-ec36-7cca79c50c81.htm
---
# Autodesk.Revit.DB.ImageTypeStatus

Indicates the current state of the contents of the ImageType.

## Syntax (C#)
```csharp
public enum ImageTypeStatus
```